class Nakath{

  String name;
  String time;
  String description;

  Nakath ({this.name, this.time, this.description});

}

List<Nakath> nakaths  = [
  Nakath(
      name: 'නව සඳ බැලීම',
      time: 'අප්‍රේල් මස 16',
      description: 'අභිනව චන්ද්‍ර වර්ෂය සහ අභිනව සූර්ය වර්ෂය සඳහා අප්‍රේල් මස 16 වන සිකුරාදා දින නව සඳ බැලීම මැනවි.'),
  Nakath(
      name: 'පරණ අවුරුද්ද සඳහා ස්නානය',
      time: 'අප්‍රේල් මස 12',
      description: ' අප්‍රේල් මස 12 වෙනි සඳුදා දින දිවුල්පත් යුෂ මිශ්‍ර නානු ගා ස්නානය කොට ඉෂ්ට දේවතා අනුස්මරණයෙහි යෙදී වාසය මැනවි.'),
  Nakath(
      name: 'අලුත් අවුරුදු උදාව',
      time: 'අප්‍රේල් මස 14 - 02.33 ට',
      description: ' අප්‍රේල් මස 14 වැනි බදාදා දින පූර්ව භාග 02.33 ට සිංහල අලුත් අවුරුද්ද උදා වෙයි.'),
  Nakath(
      name: 'පුණ්‍ය කාලය',
      time: 'අප්‍රේල් මස 13 - 8.09 සිට අප්‍රේල් මස 14 - 08.57',
      description: ' අප්‍රේල් මස 13 වන අඟහරුවාදා අපර භාග 8.09 සිට 14 වැනි බදාදා පූර්ව භාග 08.57 දක්වා පුණ්‍ය කාලය බැවින් අප්‍රේල් මස 13 වන අඟහරුවාදා දින අපර භාග 8.09 ට පළමුව ආහාර පාන ගෙන සියලු වැඩ අත්හැර ආගමික වතාවත්වල යෙදීම ද පුණ්‍ය කාලයේ අපර කොටස තුළ එනම්; 14 වන බදාදා දින පූර්ව භාග 02.33 සිට එදිනම පූර්ව භාග 08.57 දක්වා කාලය තුළ පහත දැක්වෙන අයුරින් ආහාර පිසීම, වැඩ ඇල්ලීම, ගනුදෙනු කිරීම හා ආහාර අනුභවය ආදී නැකත් චාරිත්‍ර විධි ඉටු කිරීමද මැනවි.'),
  Nakath(
      name: 'ආහාර පිසීම',
      time: 'අප්‍රේල් මස 14 - 06.17 ට',
      description: ' අප්‍රේල් මස 14 වැනි බදාදා පූර්ව භාග 06.17 ට ළා කොළ (පලාවන්) පැහැති වස්ත්‍රාභරණයෙන් සැරසී නැගෙනහිර දිශාව බලා ලිප් බැඳ, ගිනි මොළවා, එළකිරි මිශ්‍ර කිරිබතක් ද මුං ඇට මිශ්‍ර කැවිලි වර්ගයක් ද පිළියෙල කරගැනීම මැනවි.'),
  Nakath(
      name: 'වැඩ ඇල්ලීම, ගනුදෙනු කිරීම ආහාර අනුභවය',
      time: 'අප්‍රේල් මස 14 - 07.41 ට',
      description: ' අප්‍රේල් මස 14 වැනි බදාදා පූර්ව භාග 07.41 ට ළා කොළ පලාවන් පැහැති වස්ත්‍රාභරණයෙන් සැරසී නැගෙනහිර දිශාව බලා සියලු වැඩ අල්ලා ගනුදෙනු කොට ආහාර අනුභවය මැනවි.'),
  Nakath(
      name: 'හිසතෙල් ගෑම',
      time: 'අප්‍රේල් මස 17 - 07.16 ට',
      description: ' අප්‍රේල් මස 17 වැනි සෙනසුරාදා උදේ 07.16 ට නිල් පැහැති වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා හිසට නුග පත්ද පයට කරඳ පත් ද තබා නුග පත් යුෂ මිශ්‍ර නානු ද තෙල් ද ගා ස්නානය කිරීම මැනවි.'),
  Nakath(
      name: 'රැකීරක්ෂා සඳහා පිටත්ව යෑම',
      time: 'අප්‍රේල් මස 19 - 06.39 ට',
      description: ' අප්‍රේල් මස 19 වන සඳුදා උදේ 06.39 ට සුදු පැහැති වස්ත්‍රාභරණයෙන් සැරසී, දී කිරි සහ ගිතෙල් මිශ්‍ර කිරිබතක් සහ කැවිලි වර්ග අනුභව කර දකුණු දිශාව බලා පිටත්ව යෑම මැනවි.')
];